% Integração numérica
% Integral - expressao analitica
% trapz - tabela de pontos

%M6.1
x1 = [0.0 0.5 1.0 1.5 2.0 2.5 3.0 4.0 5.0]
f1 = [-4271 -2522 -499 1795 4358 7187 10279 13633 17247]
I1 = trapz(x1,f1)

%M6.2
f2 = @(x) 4 ./ (1+x.^2)
I2 = integral(f2,0,1)

%M6.3
x3 = [-1 -0.95 -0.8 -0.6 -0.4 -0.2 0.2 0.6 1.0 1.4]
f3 = [-1 -0.05 1 0.980 0.95 0.9 0.85 0.2 -0.5 -2]
I3 = trapz(x3,f3)

%M6.3 - b --> com um h constante
x3b = [-0.2 0.2 0.6 1.0 1.4]
f3b = [0.9 0.85 0.2 -0.5 -2]
I3b = trapz(x3b,f3b)

%M6.4
f4 = @(x) (3 + 3*x + x.^2) ./ (3 + 6*x + 6*(x.^2) + 2*(x.^3))
I4 = integral(f4,0,1)

%6.9
f = @(x) x.^2 + 1 ./ (1+x)
I = integral(f,0,1)

%6.2
t = [0.0 0.3 0.6 0.8 1.0 1.2 1.8 2.4 3.0 3.6 4.2]
v = [4.0 3.9 3.7 3.5 3.3 2.9 2.5 2.0 1.25 0.75 0.0]
Iv = trapz(t,v)

%6.2 -> com pontos igualmente espaçados
t2 = [0.0 0.6 1.2 1.8 2.4 3.0 3.6 4.2]
v2 = [4.0 3.7 2.9 2.5 2.0 1.25 0.75 0.0]
Iv2 = trapz(t2,v2)